name: "lfw_siamese_train_test_full_1.00_5C3F"
layer {
  name: "data_full_1.00"
  type: "MemoryData"
  top: "data_full_1.00_all"
  top: "sim_all"
  include {
    phase: TRAIN
  }  
  memory_data_param {
    batch_size: 40
    channels: 3
    height: 80
    width: 60
  }
}
layer {
  name: "data_full_1.00"
  type: "MemoryData"
  top: "data_full_1.00_all"
  top: "sim_all"
  include {
    phase: TEST
  }
  memory_data_param {
    batch_size: 20
    channels: 3
    height: 80
    width: 60
  }
}
layer {
  name: "slice_data_full_1.00"
  type: "Slice"
  bottom: "data_full_1.00_all"
  top: "data_full_1.00"
  top: "data_full_1.00_p"
  slice_param {
    slice_dim: 0 
  }
  include {
    phase: TRAIN
  }
}
layer {
  name: "slice_data_full_1.00"
  type: "Slice"
  bottom: "data_full_1.00_all"
  top: "data_full_1.00"
  top: "data_full_1.00_p"
  slice_param {
    slice_dim: 0 
  }
  include {
    phase: TEST
  }
}
layer {
  name: "slice_sim"
  type: "Slice"
  bottom: "sim_all"
  top: "sim"
  top: "sim_p"
  slice_param {
    slice_dim: 0 
  }
  include {
    phase: TRAIN
  }
}
layer {
  name: "slice_sim"
  type: "Slice"
  bottom: "sim_all"
  top: "sim"
  top: "sim_p"
  slice_param {
    slice_dim: 0 
  }
  include {
    phase: TEST
  }
}
layer {
  name: "conv1_full_1.00"
  type: "Convolution"
  bottom: "data_full_1.00"
  top: "conv1_full_1.00"
  param {
    name: "conv1_full_1.00_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_full_1.00_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_full_1.00"
  type: "ReLU"
  bottom: "conv1_full_1.00"
  top: "conv1_full_1.00"
}
layer {
  name: "pool1_full_1.00"
  type: "Pooling"
  bottom: "conv1_full_1.00"
  top: "pool1_full_1.00"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1_full_1.00"
  type: "LRN"
  bottom: "pool1_full_1.00"
  top: "norm1_full_1.00"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2_full_1.00"
  type: "Convolution"
  bottom: "norm1_full_1.00"
  top: "conv2_full_1.00"
  param {
    name: "conv2_full_1.00_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2_full_1.00_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
#    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu2_full_1.00"
  type: "ReLU"
  bottom: "conv2_full_1.00"
  top: "conv2_full_1.00"
}
layer {
  name: "pool2_full_1.00"
  type: "Pooling"
  bottom: "conv2_full_1.00"
  top: "pool2_full_1.00"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm2_full_1.00"
  type: "LRN"
  bottom: "pool2_full_1.00"
  top: "norm2_full_1.00"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv3_full_1.00"
  type: "Convolution"
  bottom: "norm2_full_1.00"
  top: "conv3_full_1.00"
  param {
    name: "conv3_full_1.00_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv3_full_1.00_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_full_1.00"
  type: "ReLU"
  bottom: "conv3_full_1.00"
  top: "conv3_full_1.00"
}
layer {
  name: "pool3_full_1.00"
  type: "Pooling"
  bottom: "conv3_full_1.00"
  top: "pool3_full_1.00"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv4_full_1.00"
  type: "Convolution"
  bottom: "pool3_full_1.00"
  top: "conv4_full_1.00"
  param {
    name: "conv4_full_1.00_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_full_1.00_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
#    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu4_full_1.00"
  type: "ReLU"
  bottom: "conv4_full_1.00"
  top: "conv4_full_1.00"
}
layer {
  name: "conv5_full_1.00"
  type: "Convolution"
  bottom: "conv4_full_1.00"
  top: "conv5_full_1.00"
  param {
    name: "conv5_full_1.00_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv5_full_1.00_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
#    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu5_full_1.00"
  type: "ReLU"
  bottom: "conv5_full_1.00"
  top: "conv5_full_1.00"
}
layer {
  name: "fc6_full_1.00"
  type: "InnerProduct"
  bottom: "conv5_full_1.00"
  top: "fc6_full_1.00"
  param {
    name: "fc6_full_1.00_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc6_full_1.00_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu6_full_1.00"
  type: "ReLU"
  bottom: "fc6_full_1.00"
  top: "fc6_full_1.00"
}
layer {
  name: "drop6_full_1.00"
  type: "Dropout"
  bottom: "fc6_full_1.00"
  top: "fc6_full_1.00"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7_full_1.00"
  type: "InnerProduct"
  bottom: "fc6_full_1.00"
  top: "fc7_full_1.00"
  param {
    name: "fc7_full_1.00_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc7_full_1.00_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu7_full_1.00"
  type: "ReLU"
  bottom: "fc7_full_1.00"
  top: "fc7_full_1.00"
}
layer {
  name: "drop7_full_1.00"
  type: "Dropout"
  bottom: "fc7_full_1.00"
  top: "fc7_full_1.00"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc8_siamese_full_1.00"
  type: "InnerProduct"
  bottom: "fc7_full_1.00"
  top: "fc8_siamese"
  param {
    name: "fc8_siamese_full_1.00_w"
    lr_mult: 100
    decay_mult: 1
  }
  param {
    name: "fc8_siamese_full_1.00_b"
    lr_mult: 200
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "conv1_full_1.00_p"
  type: "Convolution"
  bottom: "data_full_1.00_p"
  top: "conv1_full_1.00_p"
  param {
    name: "conv1_full_1.00_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_full_1.00_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 2
    kernel_size:5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_full_1.00_p"
  type: "ReLU"
  bottom: "conv1_full_1.00_p"
  top: "conv1_full_1.00_p"
}
layer {
  name: "pool1_full_1.00_p"
  type: "Pooling"
  bottom: "conv1_full_1.00_p"
  top: "pool1_full_1.00_p"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1_full_1.00_p"
  type: "LRN"
  bottom: "pool1_full_1.00_p"
  top: "norm1_full_1.00_p"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2_full_1.00_p"
  type: "Convolution"
  bottom: "norm1_full_1.00_p"
  top: "conv2_full_1.00_p"
  param {
    name: "conv2_full_1.00_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2_full_1.00_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
#    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu2_full_1.00_p"
  type: "ReLU"
  bottom: "conv2_full_1.00_p"
  top: "conv2_full_1.00_p"
}
layer {
  name: "pool2_full_1.00_p"
  type: "Pooling"
  bottom: "conv2_full_1.00_p"
  top: "pool2_full_1.00_p"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm2_full_1.00_p"
  type: "LRN"
  bottom: "pool2_full_1.00_p"
  top: "norm2_full_1.00_p"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv3_full_1.00_p"
  type: "Convolution"
  bottom: "norm2_full_1.00_p"
  top: "conv3_full_1.00_p"
  param {
    name: "conv3_full_1.00_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv3_full_1.00_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_full_1.00_p"
  type: "ReLU"
  bottom: "conv3_full_1.00_p"
  top: "conv3_full_1.00_p"
}
layer {
  name: "pool3_full_1.00_p"
  type: "Pooling"
  bottom: "conv3_full_1.00_p"
  top: "pool3_full_1.00_p"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv4_full_1.00_p"
  type: "Convolution"
  bottom: "pool3_full_1.00_p"
  top: "conv4_full_1.00_p"
  param {
    name: "conv4_full_1.00_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_full_1.00_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
#    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu4_full_1.00_p"
  type: "ReLU"
  bottom: "conv4_full_1.00_p"
  top: "conv4_full_1.00_p"
}
layer {
  name: "conv5_full_1.00_p"
  type: "Convolution"
  bottom: "conv4_full_1.00_p"
  top: "conv5_full_1.00_p"
  param {
    name: "conv5_full_1.00_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv5_full_1.00_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
#    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu5_full_1.00_p"
  type: "ReLU"
  bottom: "conv5_full_1.00_p"
  top: "conv5_full_1.00_p"
}
layer {
  name: "fc6_full_1.00_p"
  type: "InnerProduct"
  bottom: "conv5_full_1.00_p"
  top: "fc6_full_1.00_p"
  param {
    name: "fc6_full_1.00_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc6_full_1.00_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu6_full_1.00_p"
  type: "ReLU"
  bottom: "fc6_full_1.00_p"
  top: "fc6_full_1.00_p"
}
layer {
  name: "drop6_full_1.00_p"
  type: "Dropout"
  bottom: "fc6_full_1.00_p"
  top: "fc6_full_1.00_p"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7_full_1.00_p"
  type: "InnerProduct"
  bottom: "fc6_full_1.00_p"
  top: "fc7_full_1.00_p"
  param {
    name: "fc7_full_1.00_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc7_full_1.00_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu7_full_1.00_p"
  type: "ReLU"
  bottom: "fc7_full_1.00_p"
  top: "fc7_full_1.00_p"
}
layer {
  name: "drop7_full_1.00_p"
  type: "Dropout"
  bottom: "fc7_full_1.00_p"
  top: "fc7_full_1.00_p"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  name: "fc8_siamese_full_1.00_p"
  type: "InnerProduct"
  bottom: "fc7_full_1.00_p"
  top: "fc8_siamese_p"
  param {
    name: "fc8_siamese_full_1.00_w"
    lr_mult: 100
    decay_mult: 1
  }
  param {
    name: "fc8_siamese_full_1.00_b"
    lr_mult: 200
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}

layer {
  name: "loss"
  type: "ContrastiveLoss"
  bottom: "fc8_siamese"
  bottom: "fc8_siamese_p"
  bottom: "sim"
  top: "loss"
  contrastive_loss_param {
    margin: 50
  }
}
layer {
  name: "diff"
  type: "Eltwise"
  bottom: "fc8_siamese"
  bottom: "fc8_siamese_p"
  top: "diff"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: -1
  }
}
layer {
  name: "l2_norm_square"
  type: "Reduction"
  bottom: "diff"
  top: "l2_norm_square"
  reduction_param {
    operation: SUMSQ
    axis:1
  }
}
layer {
  name: "l2_norm"
  type: "Power"
  bottom: "l2_norm_square"
  top: "l2_norm"
  power_param {
    power: 0.5
    scale: 1
    shift: 0
  }
}
layer {
  name: "l2_norm_negative"
  type: "Power"
  bottom: "l2_norm"
  top: "l2_norm_negetive"
  power_param {
    power: 1
    scale: -1
    shift: 0
  }
}
layer {
  name: "threshold"
  type: "Threshold"
  bottom: "l2_norm_negetive"
  top: "predict"
  threshold_param {
    threshold: -20.5
  }
}
layer {
  name: "predict_error"
  type: "EuclideanLoss"
  bottom: "predict"
  bottom: "sim"
  top: "predict_error"
  loss_weight: 0
}
